Revit 2024 API
Stairs.DesiredRisersNumber Property
 The number of risers is calculated based on the height between levels.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int DesiredRisersNumber { get; set; }
Visual Basic
Public Property DesiredRisersNumber As Integer
	Get
	Set
Visual C++
public:
property int DesiredRisersNumber {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for numberOfRisers is not positive.
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace